# Задача 3. Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между
# максимальным и минимальным значением дробной части элементов.
# *Пример:*
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

lst = [2.2, 1.2, 3.1, 1.09, 4.01, 2.4]
min_elem = 1
max_elem = 0
for i in lst:
    if (i - int(i)) <= min_elem:
        min_elem = i - int(i)
    if (i - int(i)) >= max_elem:
        max_elem = i - int(i)
print(format(float(max_elem - min_elem), ".2f"))